      ******************************************************************
      * Author:
      * Date:
      * Purpose:
      * Tectonics: cobc
      ******************************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID. YOUR-PROGRAM-NAME.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.

            IF 3 > 5
                DISPLAY "3 is greater than 5!"
            END-IF

            IF 7 > 2
                DISPLAY "7 is greater than 2!"
            END-IF

            DISPLAY 5 > 4
            STOP RUN.
       END PROGRAM YOUR-PROGRAM-NAME.
